[{"idx":0,"id":"00223299-aabd-4f6e-810f-3b3207cc90c1","title":"Machine Operator","description":"Operate pasteurizers, homogenizers, and monitor production\n","company":"Takol Limited","location":"Not Specified","job_type":"full-time","salary_range":"Not Specified","deadline":"2025-06-30","requirements":"Relevant food production experience","link":"zidimaresourcing@yahoo.co.uk","featured":false,"created_at":"2025-06-25 11:54:27.06437+00"},{"idx":1,"id":"014c82a5-00f3-4128-998b-b63a20870f4c","title":"Internal Audit Manager","description":"Safari Pharmacy is seeking an analytical Internal Audit Manager to assess and enhance internal control systems in Warri. The position involves conducting audits, identifying risks, providing improvement recommendations, and ensuring regulatory compliance across departments.","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"Candidates should have 0–5 years of experience in auditing or related fields, with strong analytical, problem-solving, and communication skills. Proficiency in audit tools, attention to detail, and the ability to manage multiple priorities independently are essential.","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 15:01:21.625434+00"},{"idx":2,"id":"01c9f79f-eaff-46d0-82a2-413878f6f70a","title":"Administrative Assistant (Remote)","description":"A reputable company is looking for a proactive and detail-oriented Executive Assistant to support its Business Development Team. The ideal candidate will manage executive schedules, handle communications, prepare reports and analyses, and ensure the smooth execution of team objectives. This role is perfect for someone tech-savvy, highly organized, and an excellent communicator.","company":"Remote","location":"Preferable Location(s): Akure, Nigeria | Lagos, Nigeria | Aberdeen, United Kingdom of Great Britain and Northern Ireland","job_type":"full-time","salary_range":"","deadline":"2025-09-30","requirements":"Preferably with 1 year of Executive Assistant experience, a high school degree, strong organizational and communication skills, tech-savvy, and PA certification is a plus.","link":"https://mhubenterprise.freshteam.com/jobs/S2S4K6Tr7GsR/administrative-assistant-remote?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","featured":false,"created_at":"2025-07-24 14:10:27.827488+00"},{"idx":3,"id":"04bfb565-dc1f-48c2-a9a7-001a26171a5a","title":"KPMG Global Internship Program 2025","description":"KPMG’s Global Internship Program (GIP) is your chance to jump-start your global career through a four-week rotation in another country.","company":"KPMG","location":"Global","job_type":"full-time","salary_range":"","deadline":"2025-12-31","requirements":"KPMG offer program placements in tax, audit and advisory. The application process is highly competitive and the selection process is designed to make sure you’re ready to thrive when confronted with international business challenges.","link":"https://kpmg.com/il/en/home/careers/graduates/global-internship-program.html","featured":false,"created_at":"2025-07-08 06:33:15.335582+00"},{"idx":4,"id":"0f6d56af-994d-483c-b271-525d3aeb9c05","title":"EditVisions is Hiring Remote Freelance Video Editors","description":"EditVisions is a premium remote video editing agency working with YouTubers, course creators, and marketing-driven brands. We specialize in long-form YouTube videos, short-form content, 2D motion graphics, VSLs, ads, and structured business editing.","company":"EditVisions","location":"Remote","job_type":"remote","salary_range":"","deadline":"2025-12-31","requirements":"1+ Year experience, English is the language of communication.","link":"https://www.editvisions.com/hiring","featured":false,"created_at":"2025-07-08 09:40:21.305728+00"},{"idx":5,"id":"105d00bc-3664-45f3-84bc-10d2aaddab13","title":"Data Science Nigeria Call for Pidgin English Speakers to Train AI","description":"Data Science Nigeria (DSN) is calling for native Nigerian Pidgin speakers with clear and confident voices to record short audio scripts. This initiative aims to leverage Nigeria’s linguistic diversity for data collection and analysis related to language models and AI. Participants can earn up to ₦30,000 for an hour of recording, simply by reading scripts aloud on their phones.","company":"Data Science Nigeria","location":"Nigeria","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"Fluency in Nigerian Pidgin: You must be able to speak Nigerian Pidgin fluently.\nClear, Expressive Voice: Your voice should be clear and expressive for high-quality audio recording.\nReading and Comprehension Skills: You should be able to read and understand Nigerian Pidgin clearly, including the nuances of proverbs and local expressions.","link":"bit.ly/PidginSpeakers","featured":false,"created_at":"2025-07-08 11:05:15.853932+00"},{"idx":6,"id":"11b3fc2e-5d66-47cf-a056-01c1976b6212","title":"Medical Laboratory Scientist","description":"Safari Pharmacy seeks a skilled Medical Laboratory Scientist to conduct tests, analyze results, and support healthcare delivery in Warri. The role ensures accurate diagnostics and contributes to community well-being.\n","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"Candidates must have 2–5 years of lab experience, deep knowledge of laboratory techniques, and strong analytical and communication skills. Attention to detail and ability to collaborate within a healthcare team are essential.","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 15:03:13.706258+00"},{"idx":7,"id":"152e4f7e-1b3d-4fc8-a7cc-35ca4aefe449","title":"Cashier/Sales Representative","description":"Safari Pharmacy is hiring a customer-focused Cashier/Sales Rep to manage payments, assist customers, and promote products in Warri. This role ensures smooth checkouts and supports inventory and customer engagement.","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"0–5 years in retail or customer service, Cash handling and POS proficiency, Strong communication skills, Able to multitask in fast-paced settings","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 14:53:59.103334+00"},{"idx":8,"id":"202bd575-04a7-4efe-b771-6bdfa8af9ada","title":"TotalEnergies Young Talent Trainee Program 2025 For Africans | Monthly Stipends, Training, and Employment Opportunity","description":"TotalEnergies Young Graduate Program is an opportunity for young people to discover working life through a genuine hands-on professional experience while benefiting from international exposure just after graduating from university.\n\nYou will be offered a competitive monthly salary and the opportunity to gain hands-on experience at the TotalEnergies offices in South Africa.","company":"TotalEnergies","location":"Africa","job_type":"internship","salary_range":"","deadline":"2025-08-31","requirements":"Matric Plus\nB/Btech degree in the following Engineering areas: Mechanical/Electrical/Electromechanical and geographically mobile.\nB/Btech degree Finance disciplines /Accounting Technician NQ5 qualification","link":"https://jobs.totalenergies.com/en_US/careers/JobDetail/Young-Talent-Trainee/53389","featured":false,"created_at":"2025-07-08 11:18:44.688477+00"},{"idx":9,"id":"275af9d7-1584-4908-81c1-396735abed22","title":"Remote Web Designers","description":"Coalition Technologies is one of the leading SEO & web design agencies in the United States. Our purpose is to provide exceptional online marketing services to a wide variety of clients and industries.\n\nOur purpose and values would be meaningless if we didn’t have the personnel to deliver on them. To that end, Coalition is more than just a service provider or a product. We are a team of expert developers, inspired creatives, passionate digital strategists, and talented marketers.\n\nWe’re hiring for Remote Web Designers:","company":"Coalition Technologies","location":"Remote","job_type":"full-time","salary_range":"","deadline":"2025-12-31","requirements":"Mastery of video/photo editing software.\nExperience with Adobe After Effects or Adobe Premiere Pro.\nKnowledge of HTML, CSS, and how that applies to what developers can and cannot do for the web (preferred).\nA passion for design in general with an understanding of critical core concepts and design fundamentals.\nA desire to continue learning and to keep up with the design industry.\nAn awesome portfolio showcasing experience designing websites (e-commerce preferred) and web app dashboards.\nExperience with project tools such as Basecamp and G-Suite (preferred).\nExperience presenting materials to clients professionally.\nThe ability to perform well under pressure and under short deadlines.\nThe availability to work 40 hours per week from 9:00 am to 6:00 pm Pacific Standard Time, Monday to Friday.\nExcellent written and spoken English.\nA reliable workstation with a fast computer, microphone and speakers, and reliable internet and power.","link":"https://app.testedrecruits.com/posting/15348","featured":false,"created_at":"2025-07-30 23:23:40.93905+00"},{"idx":10,"id":"2ab964a1-813d-45d9-a8dd-8ddc44761bc6","title":"General Electric Graduate Internship Program 2025","description":"General Electric, a top international company with branches in over 100 countries, is offering young Nigerians the chance to join their Graduate Internship Program. This program is not just an academic exercise—it pays real money and provides work experience with GE’s medical equipment team.","company":"GENERAL ELECTRIC","location":"Nigeria","job_type":"internship","salary_range":"","deadline":"2025-12-31","requirements":"Open to all!","link":"https://www.ge.com/taxonomy/term/5777","featured":false,"created_at":"2025-07-08 09:04:24.79247+00"},{"idx":11,"id":"3003b637-4f3a-4733-8219-5c5b40539a76","title":"UNDP Digital Transformation Internship 2025 – Global Call","description":"Apply for the UNDP Digital Transformation Internship: Global Call for 2025!\n\nThe UNDP Digital Transformation Internship 2025 is open to Bachelor’s, Master’s Degree, and graduate students, and allows interns to use digital technology in UNDP’s development projects.\n\nSelected applicants get a monthly stipend between $200 and $500 and the opportunity to mission to end poverty, build democratic governance, the rule of law, and inclusive institutions around the world.","company":"UNDP","location":"Global","job_type":"full-time","salary_range":"","deadline":"2025-09-01","requirements":"To apply, candidates must be ready to submit the following documents;\n\nLetter from their university confirming current enrollment and graduation date.\nCopy of their most recent school transcript.\nCopy of passport.\nVisa copy- If the candidate is located in the USA (United States of America)\nSigned UNDP Internship Agreement.\nMedical Certificate of Good Health.\nProof of Medical Insurance.","link":"https://estm.fa.em2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1/job/24155","featured":false,"created_at":"2025-07-08 11:47:10.334476+00"},{"idx":12,"id":"322ad257-14a2-40f4-a290-f9cdca0f18e0","title":"Hiring for Remote Virtual Assistant at Interviews Chat","description":"We’re building the ultimate AI Interview Copilot to help people ace job interviews. From real-time suggestions in live meetings to personalized practice sessions, our tool is trusted by thousands of job seekers worldwide. As our Virtual Assistant, you’ll be the right hand to our founder and core team, keeping things running smoothly behind the scenes.","company":"Interviews Chat","location":"Remote","job_type":"remote","salary_range":"","deadline":"2025-07-18","requirements":"Proven experience as a virtual assistant or in a relevant administrative role, Excellent written and verbal communication skills, Proficient in MS Office Suite, Google Workspace, and other virtual collaboration tools (Zoom, Slack, Trello, etc.), Strong time-management and organizational skills, Ability to multitask and meet deadlines\nHigh level of discretion and confidentiality, Tech-savvy and quick to learn new tools or platforms.","link":"careers@interviews.chat","featured":false,"created_at":"2025-07-08 11:34:38.845308+00"},{"idx":13,"id":"33a6b937-32c7-4b08-b816-8b2866ea43a4","title":"Social Media Manager","description":"Safari Pharmacy is seeking a creative Social Media Manager to boost online presence and drive digital marketing initiatives. The role involves content creation, campaign management, and brand engagement across all platforms.\n","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"3–5 years of experience in social media, excellent knowledge of major platforms, SEO, and analytics tools. Strong communication, content strategy, and time management skills are essential.","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 15:13:10.851837+00"},{"idx":14,"id":"4eba1d4c-3071-43c7-8e5b-46cc141eccf1","title":"Inventory Officer","description":"Safari Pharmacy is hiring a meticulous Inventory Officer to manage stock levels, ensure accuracy of inventory records, and coordinate procurement in Warri. This role ensures smooth operations and product availability across the pharmacy.\n","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"Applicants must have a degree in Business Admin, Supply Chain, or a related field, with 0–5 years of inventory management experience. Strong organizational skills, attention to detail, and proficiency in inventory software and Microsoft Office are necessary.\nLocation: Warri, Nigeria","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 15:02:22.316209+00"},{"idx":15,"id":"4f4b5d80-0a1e-4ce9-9f4e-fa5d5fbb7795","title":"Community Extension Health Worker (CHEW)","description":"Safari Pharmacy seeks a compassionate CHEW to provide basic healthcare, conduct screenings, and deliver health education in Warri. The role supports community wellness programs and promotes preventive care.","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"0–5 years of experience in community health, Knowledge of health principles and community outreach, Strong interpersonal and communication skills, Team-oriented with a patient-focused approach","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 14:56:27.222655+00"},{"idx":16,"id":"53cf0296-899d-45b8-8a07-d1056b7476b7","title":"Medical Laboratory Technician","description":"Safari Pharmacy is recruiting a Medical Laboratory Technician to assist with test procedures, sample preparation, and data accuracy in Warri. This role supports daily lab operations and patient care.\n","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"Applicants should have 0–5 years of lab experience, basic understanding of lab techniques, strong attention to detail, and the ability to work independently or as part of a team. Good communication and organizational skills are also required.","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 15:04:05.872144+00"},{"idx":17,"id":"581a6777-75ff-49fe-b7e2-aa1c0fbc6796","title":"Polaris Bank is Recruiting Nationwide Apply Now!","description":"Are you looking to take your career in banking to the next level? Polaris Bank, one of Nigeria’s leading financial institutions, is offering dynamic and rewarding career opportunities across various locations nationwide.\n\nPolaris Bank is on the lookout for passionate, results-oriented, and innovative professionals ready to make an impact in the banking industry.\n\nWhether you’re an experienced banker or a rising professional with a passion for finance and customer engagement, Polaris Bank has a place for you.","company":"Polaris Bank","location":"Nigeria","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"Young and vibrant.","link":"https://polarisbanklimited.zohorecruit.com/jobs/Careers","featured":false,"created_at":"2025-07-08 10:46:19.397543+00"},{"idx":18,"id":"5c318719-72f5-4983-9b27-0762f70e4ce9","title":"FCMB Management Internship Program 2025","description":"FCMB Assets Management Limited is looking for a dynamic and analytical individual to join our team as a Market Research/Customer Success Intern.\n\nThis FCMB Management Internship Program is designed to provide valuable exposure to customer engagement, data analysis, and market intelligence gathering within a dynamic work environment.\n\nYou will gain practical experience while supporting meaningful projects that contribute to business decisions and client satisfaction.","company":"FCMB","location":"Nigeria","job_type":"internship","salary_range":"","deadline":"2025-07-16","requirements":"A Degree in Economics, Business Admin or a related field, 0 – 2 years’ experience in a similar role (Client Services or Investment Operations), Basic understanding of customer service and/or market research principles, Attention to detail, Analytical and Research Skill, Presentation Skill, Technical and Digital Skills, Excellent Client Relationship Management skills, Excellent Analytical thinking skills, General understanding of Regulatory compliance, Excellent Time management skills.","link":"https://docs.google.com/forms/d/e/1FAIpQLSfZ-8LUj4ru6Ssg9A4heKgKvVMJ834ud5TxIu-IGkUiPb4NvA/viewform","featured":false,"created_at":"2025-07-08 08:05:47.660946+00"},{"idx":19,"id":"5e7e20e9-b8e4-4f6a-bdb3-16d2b50581e3","title":"Remote Graphics Designers","description":"Coalition Technologies is one of the leading SEO & web design agencies in the United States. Coalition Technologies is looking for Graphic Designers.","company":"Coalition Technologies","location":"Remote","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"Total mastery of video and photo editing software.\nA passion for design, branding, marketing, advertising, and online content creation.\nA general understanding of social media platforms such as Instagram, Facebook, Twitter, YouTube, Tik Tok, Pinterest, Tumblr, and LinkedIn.\nA desire to continue learning and to keep up with the design industry.\nAn awesome portfolio showcasing experience in designing ad banners, marketing emails, social media posts, and logos (infographics, slide presentations, and print designs are also welcome).\nKnowledge of the Google Ads and Facebook Ads platforms (highly preferred).\nKnowledge of Klaviyo and Mailchimp (preferred).\nExperience with project tools such as Basecamp, QuickBooks, and Google Docs (preferred).\nBonus points for familiarity with video editing and motion graphics software such as Adobe Premiere and After Effects.\nBonus points for illustration or traditional drawing skills.\nExcellent written and spoken English.\nProfessional experience working with advertising agencies or in digital marketing (preferred).\nThe ability to perform well under pressure and under short deadlines.\nExperience presenting materials to clients professionally.\nThe availability to work 40 hours per week from 9:00 am to 6:00 pm Pacific Standard Time, Monday to Friday.\nA reliable workstation with a fast computer, microphone, and speakers, and reliable internet and power.","link":"https://app.testedrecruits.com/posting/15328","featured":false,"created_at":"2025-07-31 21:32:12.19228+00"},{"idx":20,"id":"613912d6-7ca0-425f-8bcf-968151e87e55","title":"Quality Control Officer (Food and Beverage)","description":"Safari Pharmacy is seeking a Quality Control Officer to maintain the safety and standards of its food and beverage products. This role involves inspections, compliance checks, and collaboration with production teams to uphold quality benchmarks.\n","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"Candidates should have 0–5 years of experience in quality control, a solid understanding of food safety and industry standards, excellent attention to detail, and proficiency with QC tools. Communication and teamwork skills are also essential.","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 15:10:27.996678+00"},{"idx":21,"id":"6352fe61-f7e9-4a2e-8fa1-ae5296b51aeb","title":"WaterAid Graduate Programmes Intern 2025","description":"Apply for the 2025 WaterAid Graduate Programmes Intern!\n\nWith a population of over 150 million people, Nigeria is the most populous country in Africa. Political unrest, poor governance and corruption have led to decades of water shortages, while the population has increased rapidly.","company":"WaterAid","location":"Lagos","job_type":"internship","salary_range":"","deadline":"2025-07-09","requirements":"Completion of a 4-year undergraduate degree course in Engineering, Social sciences, or related field from a reputable university.\nCompletion of National Youth Service Corp (NYSC) programme no more than 25 years before date of application\nStrong conceptual and analytical skills.\nDemonstrate a keen aptitude and appetite for learning and personal development\nDemonstrate WaterAid values\nStrong interpersonal skills and ability to work with a variety of people.\nExcellent verbal and written communication skills.\nAbility and willingness to travel to the field.\nComputer proficiency (Office software, internet and email).","link":"https://docs.google.com/forms/d/e/1FAIpQLScvG1qNHKfT-v_04O6hwvuXe1wPpWi0-1gRl3HBKjKV-Wtekw/closedform","featured":false,"created_at":"2025-07-08 11:21:07.159181+00"},{"idx":22,"id":"6d34c4e2-3ff5-4383-8dcd-5c21ddc51e97","title":"Medical Laboratory Technician at Shalina Healthcare","description":"Shalina Healthcare is a market leader in making quality healthcare products affordable and available across Africa.\n\nWe achieve this by sourcing from WHO-approved production facilities in India and China and by focusing on our first-class distribution expertise.\n\nShalina Healthcare is privately owned and part of the Shalina Group. We have been operating in Africa for more than thirty years.\n\nThe Shalina Group is headquartered in Dubai and we have operating offices in Nigeria, Zambia, The Democratic Republic of Congo, Angola, Ghana, Republic of South Sudan, Kenya, Cameroon, Central African Republic, India and China. We employ over one thousand people worldwide","company":"Shalina Healthcare","location":"Global","job_type":"full-time","salary_range":"","deadline":"2025-12-31","requirements":"Minimum of a diploma in Medical Laboratory Technology, Previous experience in a laboratory setting or specimen accessioning is mandatory, Strong attention to detail and accuracy, Excellent organizational and multitasking skills, Good communication and interpersonal abilities, Familiarity with laboratory information systems is a plus.","link":"https://myshalina.darwinbox.com/ms/candidate/careers/a6867e6e13db70","featured":false,"created_at":"2025-07-08 10:12:22.358179+00"},{"idx":23,"id":"6d476e0d-54ea-46a4-bb6a-8210f33b266b","title":"Blue Book Traineeship Programme 2026","description":"Applications are open for the European Commission Blue Book Traineeship Programme 2026. The Blue Book Traineeship programme is a five-month paid internship offered by the European Commission, providing graduates from around the world with hands-on experience in EU policymaking and administration.\n\nTrainees work in a multicultural environment, develop professional skills, and gain insights into the operations of EU institutions.\n\nThe European Commission proposes two types of traineeship: an Administrative Traineeship or a Translation Traineeship with the Directorate-General for Translation (DGT). Trainees work all over the European Commission, its services and agencies, mostly in Brussels, but also in Luxembourg and elsewhere across the European Union.","company":"European Commission","location":"Brussels, Luxembourg and elsewhere across the European Union","job_type":"full-time","salary_range":"","deadline":"2025-08-29","requirements":"have completed a standard 3-year higher education degree (minimum EQF 6 level), corresponding to a complete Bachelor’s cycle, or equivalent. Only if you have a certificate or official confirmation from your university that you have such a degree will you be eligible to apply.\nhave no prior work experience of any kind, in excess of 6 weeks in any EU institution, body or agency, delegation, with Members of the European Parliament (MEPs), or Advocates General at the Court of Justice of the European Union (EUCJ).\nhave a very good knowledge of languages:\nFor the administrative traineeship – you must have a very good knowledge of two EU official languages, one of which must be a working language: English, French or German at C1 or C2 level as per the Common European Framework of Reference for Languages and a second one at B2 level at least as per the Common European Framework of Reference for Languages. For non-EU nationals, only one procedural language is required at C1 or C2 level.\nFor the translation traineeship in the Directorate-General for Translation (DGT) – you must be able to translate into your main/target language (normally your mother tongue), from two other official EU languages (‘source languages’).:\nyour main/target language must be one of the official EU languages\nyour first source language for translation must be a working language of the EU: English, French or German (C level or mother tongue)\nyour second source language can be any of the official EU languages with at least B2-level proficiency","link":"https://traineeships.ec.europa.eu/how-apply/application-traineeship-session_en","featured":false,"created_at":"2025-07-18 01:10:40.895295+00"},{"idx":24,"id":"77c336f3-fb7f-4b84-92e6-68c6b7488316","title":"Supermarket Manager","description":"Safari Pharmacy is recruiting a Supermarket Manager to lead daily retail operations, manage staff, and ensure customer satisfaction in Warri. The role focuses on inventory, sales performance, and store presentation.\n","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"0–5 years of experience in retail/store management, strong leadership, multitasking, and customer service skills. Familiarity with store management tools is essential.","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 15:15:03.401522+00"},{"idx":25,"id":"844a36cc-ce10-4e4b-bb0e-d184d6f6a647","title":"Funtay Group Graduate Trainee Program 2025","description":"Funtay Group (formally known as Funtay Global Resources Ltd) is a Nigerian oil and gas services company that operates across the upstream, midstream, downstream, and power sectors of the energy industry. Established in 2012 and headquartered in Lekki Phase 1, Lagos, Funtay focuses on integrated energy solutions, including oilfield development, gas monetization, and power generation, especially for marginal or stranded assets.","company":"Funtay","location":"Lagos","job_type":"full-time","salary_range":"","deadline":"2025-07-10","requirements":"Minimum of BSc Degree in accounting, finance, economics or related fields.\nCompleted your NYSC.\nO-1 years Experience.","link":"https://tables.zoho.com/fview/publish/pozGX30Q1IYPIznECA4P1g","featured":false,"created_at":"2025-07-08 11:57:51.468686+00"},{"idx":26,"id":"84873f18-ab0b-4cc3-9603-b91a5d85b88e","title":"Field Data collectors/Supervisors (Contract Role) at Triple M Dashboards (TMD)","description":"Triple M Dashboards (TMD), a leading organization in field-based data collection and monitoring, is inviting qualified and enthusiastic individuals to apply for contract roles as Field Data Collectors and Supervisors in the northern states of Nigeria.\n\nThis is a unique opportunity to support high-impact research and development programs while gaining valuable field experience and expanding your professional network.","company":"Triple M Dashboarrds","location":"All Local Government Areas (LGAs) in Kano, Jigawa, Katsina, and Kaduna States","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"Minimum academic qualification: OND/NCE (Bachelor’s degree – BSc/HND – is an added advantage).\nAt least 1 prior experience in field data collection is mandatory.\nSupervisory experience is required for Supervisor roles.\nMust be proficient in using smartphones, GPS tools, and basic digital applications.\nMust speak English fluently and at least one local language commonly spoken in the state of assignment (e.g., Hausa, Fulani, etc.).\nMust own a functional Android smartphone compatible with mobile survey apps.\nAbility to travel across selected LGAs and work under minimal supervision.","link":"https://docs.google.com/forms/d/e/1FAIpQLSfQbNzEkNCMyNkbRaFpjlquBqZ80Wkv9EkmKsL2oNmBiF5DCQ/viewform?pli=1","featured":false,"created_at":"2025-07-08 11:32:23.685045+00"},{"idx":27,"id":"84a81665-d9d3-415c-af1a-8c4ad8e9638a","title":"Social Media Officer","description":"Safari Pharmacy seeks a Social Media Officer to manage online platforms, create engaging content, and build community interaction. The role supports marketing goals and brand consistency.\n","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"0–5 years of experience in social media management, proficiency in major platforms and tools (like Hootsuite), basic SEO understanding, and strong communication skills.","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 15:14:05.550336+00"},{"idx":28,"id":"8850e4af-6a93-40b4-be16-0101428a3df1","title":"Circuit Pointe is Hiring for 2 Remote Roles","description":"Circuit Pointe is a non-profit, youth-led organization established in 2015 by a young female Nigerian after hearing untold stories of oppressed women, abused teens and victims of traditional practices.\n\nWe have a 3-member Board of Trustees and 40 volunteer members who are young people between 18-35 years.","company":"Circuit Pointe","location":"Remote","job_type":"remote","salary_range":"","deadline":"2025-07-10","requirements":"Bachelor’s degree in Human Resources, Education, Instructional Design, or related field.\n2+ years of experience in a training, facilitation, or instructional role.\nStrong knowledge of adult learning principles and training methodologies.\nProficiency with presentation tools and Learning Management Systems (LMS).\nExcellent communication, presentation, and organizational skills.\nAbility to analyze data and adjust training strategies accordingly.\nExperience with e-learning authoring tools (Articulate, Adobe Captivate, etc.).\nCertification in training or instructional design (e.g., CPTM, ATD, CIPD).\nFamiliarity with performance consulting or coaching models.","link":"info@circuitpointe.com","featured":false,"created_at":"2025-07-08 10:36:04.540536+00"},{"idx":29,"id":"89c0b51e-4363-4957-9d88-1d86143224a6","title":"Account Officer","description":"Safari Pharmacy is hiring a proactive Account Officer to handle daily financial transactions, maintain records, and ensure regulatory compliance. This role supports budget preparation, reconciliations, and cross-departmental financial management in Warri.","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"Bachelor's in Accounting, Finance, or related field, 0–5 years of experience, Strong attention to detail and analytical skills, Proficient in accounting software and Microsoft Office, Able to work independently and in teams","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 14:51:01.642353+00"},{"idx":30,"id":"8ace1ab1-ad6a-46dc-9193-8f13c31ddf2a","title":"Front Desk Admin Needed at Aimtoget Technology Limited","description":"Suppose you’re a young, smart, and professional individual passionate about customer service and administrative excellence. In that case, this is your opportunity to kickstart or elevate your career in a vibrant tech-driven environment.\n\nAimtoget Technology Limited, a growing Nigerian fintech and tech company, is currently hiring a Front Desk Admin for its Ibadan office. If you’re under 26 and ready to build a meaningful career in a forward-thinking organization, keep reading.","company":"Aimtoget Technology Limited","location":"Nigeria","job_type":"full-time","salary_range":"","deadline":"2025-07-31","requirements":"Young and vibrant.","link":"vacancy@aimtoget.com","featured":false,"created_at":"2025-07-09 08:51:10.74374+00"},{"idx":31,"id":"92b1d2b8-4c46-48c3-847f-5fb86ca0828a","title":"Pharmacist","description":"Safari Pharmacy is looking for a knowledgeable and dedicated Pharmacist to dispense medications, offer expert advice, and conduct health screenings in Warri. The role plays a key part in ensuring safe medication use and supporting public health.","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"Applicants should have 0–5 years of pharmacy experience, excellent knowledge of medications and pharmaceutical practices, strong communication and customer service skills, and proficiency in pharmacy software.","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 15:09:36.748262+00"},{"idx":32,"id":"94592672-3593-450a-ae64-a1edde027bd4","title":"Honeywell Group Graduate Trainee 2025","description":"The Finance Graduate Trainee role is designed to equip recent graduates with practical experience across core areas of corporate finance. Through a structured rotation, the trainee will gain exposure to Treasury, Risk Management, Accounting, Taxation, and Financial Analysis, developing a solid foundation in financial operations, reporting, and strategic decision-making.","company":"Honeywell Group","location":"Nigeria","job_type":"graduate-trainee","salary_range":"","deadline":"2025-08-31","requirements":"Minimum of a Second-Class Upper degree in Accounting, Finance, Economics, or related field.\nUp to 1 year of relevant experience (NYSC inclusive).\nInterest in pursuing ACA, ACCA, or CFA qualifications.\nProficient in Excel; knowledge of ERP systems is an advantage.","link":"https://www.honeywellgroup.com/careers/experienced-hires/20","featured":false,"created_at":"2025-07-09 09:37:41.832573+00"},{"idx":33,"id":"970554ba-b382-421b-b746-87a5622d4174","title":"General Duties","description":"Safari Pharmacy is hiring a reliable individual for General Duties in Warri. The role involves maintaining cleanliness, supporting security operations, and ensuring a safe and welcoming environment for staff and customers through daily facility upkeep and monitoring.","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"Applicants should have 0–5 years of experience in janitorial, maintenance, or security roles, with basic knowledge of cleaning procedures. A keen eye for safety, good communication skills, and the ability to work well in a team are required.","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 15:00:00.54903+00"},{"idx":34,"id":"a1a6ff7e-70b1-4383-a3ca-eca6ec753cdb","title":"Mixologist","description":"Safari Pharmacy is hiring a creative Mixologist to craft beverages, enhance customer experience, and maintain a vibrant bar atmosphere in Warri. This role contributes to the customer satisfaction and brand appeal of the pharmacy.\n","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"Candidates should have 0–5 years of experience in mixology or similar roles, strong knowledge of beverage preparation, excellent communication skills, and creativity. The ability to multitask and provide outstanding service in a fast-paced setting is key.","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 15:06:55.59012+00"},{"idx":35,"id":"a69ef3ff-65b7-4674-937b-c1006a558626","title":"Technical Writer/Publisher at Early Code","description":"We provide coding skills in a way you can quickly learn and apply them. Code your own logical operations, design and develop applications and websites.","company":"Early Code","location":"Abuja","job_type":"full-time","salary_range":"N100,000 (excluding tax)","deadline":"2025-07-17","requirements":"We’re seeking a candidate with a strong blend of technical understanding and exceptional communication skills. You should have:\nProven experience (1+ years) as a Technical Writer, Technical Communicator, or similar role, preferably in tech or ICT.\nExcellent written and verbal communication skills in English, with a keen eye for detail, grammar, and punctuation.\nAbility to understand complex technical concepts and explain them simply and clearly to both technical and non-technical audiences.","link":"careers@earlycode.net","featured":false,"created_at":"2025-07-08 10:41:59.301552+00"},{"idx":36,"id":"a6e7a873-1551-474c-80a7-3395ba0accab","title":"Emerson Graduate Trainee Program 2025","description":"The Graduate Sales Engineer role is a developmental program designed to train and progress future engineering and business leaders in Emerson. The candidate will undergo formal and on the job trainings in technical and commercial domains.\n\nRate of progress will be driven by personal effort and ability to demonstrate your capability. Progression will be determined by individual performance, including the demonstration of unfailing commitment to deliver on assigned responsibilities. Collaboration and willingness to learn are the key success factors for this role.","company":"Emerson","location":"","job_type":"full-time","salary_range":"","deadline":"2025-08-09","requirements":"A minimum degree in an engineering discipline with major in either electrical/electronic, chemical, mechanical engineering, physics, chemistry, geology, computer science.\nProficiency in computer skills in Microsoft Office Suite products, Must have completed the mandatory national service program (NYSC) or must have received a discharge or exemption certificate by September 2025, Fluent in English.","link":"https://hdjq.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1/job/25023130?location=Nigeria&locationId=300000000228963&locationLevel=country&mode=location","featured":false,"created_at":"2025-07-18 01:04:33.97199+00"},{"idx":37,"id":"a79e2318-b6c6-49d7-8a04-8f99eee72d7e","title":"LPG Plant Account Officer","description":"Rainoil Limited, a leading player in Nigeria’s downstream oil and gas sector, is inviting applications from qualified and interested candidates for various positions, including LPG Plant Account Officer.","company":"Rainoil Limited","location":"Bayelsa, Kaduna, Ondo, Plateau (Nigeria)","job_type":"full-time","salary_range":"","deadline":"2025-08-30","requirements":"Minimum of one (1) year of relevant experience, Strong knowledge of cash handling and financial processes, Proficiency in basic accounting and financial reconciliation.","link":"recruitment@rainoil.com","featured":false,"created_at":"2025-07-30 22:17:24.667406+00"},{"idx":38,"id":"af082aba-4372-486b-9ce6-73015e5152f3","title":"LPG Plant Supervisor","description":"The LPG Plant Supervisor is responsible for overseeing the daily operations, staff, and safety protocols of the company’s gas plant.","company":"Rainoil Limited","location":"Anambra, Bayelsa, Ondo, Plateau (Nigeria)","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"1–4 years of relevant experience in gas plant or engineering operations, Strong leadership, technical, and communication skills, High level of integrity, responsibility, and motivation.","link":"recruitment@rainoil.com","featured":false,"created_at":"2025-07-30 22:19:10.402335+00"},{"idx":39,"id":"b846822a-b323-49bd-8802-7f3a28037db8","title":"Remote Office Assistants ","description":"Coalition Technologies is one of the leading SEO & web design agencies in the United States. \n\nCoalition Technologies' values would be meaningless if we didn’t have the personnel to deliver on them.\n\nTo that end, Coalition is more than just a service provider or a product. We are a team of expert developers, inspired creatives, passionate digital strategists, and talented marketers.\n\nWe’re hiring for Remote Office Assistants:","company":"Coalition Technologies","location":"Remote","job_type":"full-time","salary_range":"$15-$25 per hour","deadline":"2025-11-30","requirements":"Willingness to learn, grow, and collaborate with the team and company as a whole,\nExcellent verbal and written communication skills,\nA high level of discretion, ethics, and trustworthiness,\nIntermediate spreadsheet skills (preferred),\nInnovative thinking and willingness to challenge existing methods where improvement is possible,\nExperience in bookkeeping / financial record keeping (preferred),\nExperience with Google Sheets or Excel, Quickbooks Online, and G Suite (preferred),\nThe availability to work 40 hours per week from 9:00 am to 6:00 pm PST,\nReliable space to work remotely – fast computer, quality internet, camera, microphone, speakers.","link":"https://app.testedrecruits.com/posting/15347","featured":false,"created_at":"2025-07-30 23:12:11.191653+00"},{"idx":40,"id":"bed4865f-54a4-4882-b4cb-06db91b1b67a","title":"Kelina Hospital is Hiring for Multiple Roles!","description":"Kelina Hospital is a surgical hospital, with a focus on Minimally Invasive Surgery.\nKelina was the first private hospital in Nigeria to do Laser Lithotripsy for Kidney Stones (PCNL, RIRS, 2011), Laparoscopic Radical Prostatectomy, LRP (2012), and Holmium Laser Enucleation of the Prostate (HoLEP, 2018).\nKelina does Laparoscopic Surgery in General Surgery, Urology, Gynaecology amongst others. HoLEP, LRP, PCNL, RIRS are the most common surgeries we do each week.\nKelina Hospital’s success is built on having talented and highly proficient people within their respective fields as the driving force behind our business.\nKelina Hospital is constantly looking to include highly skilled and innovative individuals to our staff list. Kelina is a family.","company":"Kelina Hospital","location":"Lagos & Abuja, Nigeria","job_type":"full-time","salary_range":"","deadline":"2025-10-08","requirements":"Visit the application portal for more on the various vacancies available.","link":"https://www.kelinahospital.com/career/","featured":false,"created_at":"2025-07-08 10:00:45.137725+00"},{"idx":41,"id":"bfe2e83b-fbcd-4ff4-bbd5-666f994e80f9","title":"Fountain University Recruitment","description":"Fountain University is owned by Nasrul-Lahi-Il-Fatih Society of Nigeria (NASFAT); a leading Islamic Society in Nigeria. The University commenced operation in January 2008.\n\nFountain University is committed to the total development of men and women imbued with high academic, Islamic moral and ethical values in an enabling environment, through appropriate teaching, research and service to humanity.\n\nIt is a University established to be a pace-setting institution in terms of learning, character-building and service to humanity.","company":"Fountain University","location":"Osun State","job_type":"full-time","salary_range":"","deadline":"2025-07-18","requirements":"Check: https://jobs.smartyacad.com/fountain-university-recruitment/   ","link":"vacancy@fuo.edu.ng","featured":false,"created_at":"2025-07-08 10:19:46.587601+00"},{"idx":42,"id":"c22113e0-c473-478a-b2cc-5bcc21d29d17","title":"Remote Virtual Office Manager (Administrative Assistant) Needed at IBT Media","description":"Are you a highly organized and detail-oriented individual with experience in virtual office management? We are seeking a skilled Virtual Office Manager (Administrative Assistant) to join our team remotely.\n\nThis is an excellent opportunity for a proactive professional to contribute to a dynamic and fast-paced environment.","company":"IBT Media","location":"Remote","job_type":"remote","salary_range":"","deadline":"2025-07-31","requirements":"Proven experience in coordinating calendars and managing high-level meetings (Google Calendar).\nExcellent verbal and written communication skills.\nExceptional attention to detail and the ability to prioritize multiple tasks and deadlines.\nStrong decision-making skills and a high level of discretion.\nFlexible, thorough, and self-motivated, with the ability to multi-task effectively.\nProficiency in a range of digital tools, including Excel, Google Docs, and other relevant software.\nDemonstrated ability to work independently and as part of a virtual team.","link":"https://ibt.media/careers/234/virtual-office-manager-administrative-assistant","featured":false,"created_at":"2025-07-08 11:38:19.994946+00"},{"idx":43,"id":"c42dba77-a33a-47cc-a401-545da058b56c","title":"Pharmacy Technician","description":"Safari Pharmacy is hiring a detail-oriented Pharmacy Technician in Warri to support pharmacists in dispensing medications, managing inventory, and providing top-notch customer service. This role contributes directly to the operational excellence and community healthcare impact of the pharmacy.\n","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"Candidates should have 0–5 years of experience in a pharmacy or related field, with strong knowledge of pharmaceutical practices and medications. Excellent customer service skills, attention to detail, and proficiency in pharmacy tools and software are essential.","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 15:08:33.730162+00"},{"idx":44,"id":"c72a1fa0-e185-4033-be18-2122b6fefd2a","title":"Sales Manager","description":"Safari Pharmacy is hiring a strategic Sales Manager to lead a high-performing team across its business units. The role focuses on developing sales strategies, team development, market intelligence, and customer engagement.\n","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"A Bachelor's degree in Business, Marketing (MBA preferred), with 5+ years of sales leadership experience. Candidates must have a proven record in revenue growth, team management, and multi-sector sales.","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 15:12:17.049972+00"},{"idx":45,"id":"ce79b7db-7f5f-4de3-9198-18f5a79e809f","title":"Media Trust AI Essentials Bootcamp Talent Program 2025","description":"Are you looking to develop AI skills that’ll help you save time, boost productivity, and enhance your creativity? Media Trust’s free, three-week AI Essentials Bootcamp is designed to grow confidence using AI tools and to give you a competitive edge.\n\nAI has the potential to level the playing field for early-career, under-represented talent in the creative industries, offering new opportunities for innovation and efficiency.\n\nIn fact, a recent study found that AI adoption could boost productivity by up to 40%, helping professionals work smarter and more creatively.\n\nThat’s why Media Trust, with support from the Centre for Public Impact and Google AI Opportunity Fund: Europe, is offering a free AI training programme to help you understand, explore and integrate AI into your work with confidence.","company":"Media Trust","location":"","job_type":"full-time","salary_range":"","deadline":"2025-07-31","requirements":"If you have little or no experience using AI but are eager to learn and grow, this opportunity is for you. Priority will be given to early-career professionals from under-represented backgrounds in the media and creative industries.","link":"https://mediatrust.org/youth-programmes/ai-essentials-bootcamp-for-talent/ai-essential-bootcamp-talent-application-form/","featured":false,"created_at":"2025-07-08 11:50:20.930649+00"},{"idx":46,"id":"d057927e-470b-464e-91fb-561ff6da79c3","title":"Radiographer","description":"Safari Pharmacy is recruiting a skilled Radiographer to perform diagnostic imaging, including general radiography and ultrasonography. The position supports healthcare professionals with accurate diagnostic data.\n","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"A B.Sc. in Diagnostics or related field with 2–3 years of radiography experience is required. Candidates should be detail-oriented, patient-focused, and capable of working independently within a clinical team.","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 15:11:24.85664+00"},{"idx":47,"id":"d3aa2645-1a82-47c8-a7e6-2e0db144188b","title":"Access Bank Entry Level Program 2025","description":"Access Bank Plc, commonly known as Access Bank, is an African multinational commercial bank, owned by Access Bank Group. It is licensed by the Central Bank of Nigeria and other Africa nations.","company":"Access Bank Plc","location":"Africa","job_type":"full-time","salary_range":"","deadline":"2025-12-31","requirements":"Candidates must not be older than 26 years as at the date of application.\nCandidates must have a minimum of second class upper (2:2) from a reputable university.\nCandidates must have completed NYSC.","link":"https://careers.accessbankplc.com/careers","featured":false,"created_at":"2025-07-08 07:51:13.96658+00"},{"idx":48,"id":"e30236ef-a451-42df-87e0-1e06af3f4ea0","title":"Accountant","description":"Safari Pharmacy seeks a detail-oriented and analytical Accountant to manage financial records, ensure compliance with standards, and support the company’s financial health in Warri. The role includes preparing reports, conducting audits, managing payables/receivables, and contributing to strategic financial planning.","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"2–5 years of accounting experience, ICAN or ACCA certification, Strong analytical and organizational skills, Proficient in accounting software and Microsoft Office, Team player with strong communication skills","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 14:49:29.917123+00"},{"idx":49,"id":"e5c433d1-4458-4a08-b42b-c03212672d68","title":"Remote Hiring at Fokes Consult 2025","description":"Fokes Consult is a Lagos-based business and human capital development company committed to helping individuals and organizations grow through strategic branding, recruitment services, digital marketing, and career support.\n\nWith a track record of supporting startups, real estate firms, and corporate brands, we focus on delivering tailored consulting services and equipping talents with the tools they need to succeed in today’s fast-evolving market.\n\nOpen Positions:\n\nMarketing Manager\nBusiness Development Executive\nDigital Marketer\nSocial Media Manager","company":"Fokes Consult","location":"","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"A degree in Marketing, Communications, Business Administration, or a related field, Proven experience in your area of expertise, Strong written and verbal communication skills, Good understanding of market trends, branding, and customer engagement strategies, Familiarity with the real estate or consulting industry is a plus, Ability to resume immediately (as stated in the flyer).","link":"https://bit.ly/fokescareers","featured":false,"created_at":"2025-07-08 11:02:49.852581+00"},{"idx":50,"id":"e867ed8a-59ee-4ed5-aa56-ede71aa19f2d","title":"Brand Manager","description":"Job Description:\nSafari Pharmacy is seeking a creative Brand Manager to develop and implement strategies that elevate brand visibility and customer engagement in Warri. The role includes market research, brand communications, and campaign management.","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"Bachelor's degree in Marketing, Business Admin, or related field, 0–5 years of experience in branding or marketing, Strategic thinking and creativity, Strong communication and team collaboration skills","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 14:52:27.57772+00"},{"idx":51,"id":"ed7bf174-7142-4e34-bada-28bca624502a","title":"Facility Officer","description":"Safari Pharmacy is looking for diligent and proactive Facility Officers to maintain its facilities in Warri. The role involves performing routine maintenance, troubleshooting equipment, ensuring safety compliance, and coordinating repair services to ensure a functional and safe environment for both staff and customers.","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"Candidates should have 0–5 years of experience in facility maintenance or a related field. They must possess strong problem-solving abilities, good communication and organizational skills, and basic knowledge of maintenance tools and procedures. The ability to work both independently and collaboratively is essential.","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 14:59:02.926017+00"},{"idx":52,"id":"ee2e386e-f85b-49a9-8fde-d721acf3ccaf","title":"UBA Graduate Trainee Program 2025","description":"UBA group strongly believe that people are critical to its success in building a sustainable and dominant business in the countries we operate in, across Africa and beyond. UBA will go to great lengths to source, attract, recruit, develop and retain the best talent, wherever they may be in the world.","company":"UBA GROUP","location":"Africa","job_type":"full-time","salary_range":"","deadline":"2025-07-20","requirements":"Bachelor's degree (Minimum Second Class Lower) from a government-accredited institution.\n\nMust have completed NYSC or its equivalent.\n\nMust not be more than 27 years by December 31, 2025","link":"https://jointhetribe.ubagroup.com/apply","featured":false,"created_at":"2025-07-08 07:55:27.752945+00"},{"idx":53,"id":"ee519529-37ac-48de-b9a1-acaa25d93e94","title":"Qorebox Is Hiring 2025: 5 Tech Roles","description":"Qorebox is a technology solutions company based in Abuja, Nigeria. We are focused on building secure, scalable, and innovative IT infrastructures that power businesses across Africa.\n\nHere are the available job roles at Qorebox:\n\nData Scientist,\nDevOps Engineer,\nCloud Engineer,\nCybersecurity Specialist,\nMobile Developer.","company":"Qorebox","location":"Abuja, Nigeria","job_type":"full-time","salary_range":"","deadline":"2025-07-19","requirements":"Minimum of 2–4 years of relevant experience (depending on role),\nStrong communication and collaboration skills,\nExperience working in agile development environments,\nDemonstrated problem-solving ability and attention to detail,\nPortfolio, GitHub profile, or examples of past work will be an advantage.","link":"recruitment@qorebox.com","featured":false,"created_at":"2025-07-08 10:53:23.687367+00"},{"idx":54,"id":"fb99f3e5-1497-439a-a3d0-8a4b778cfc20","title":"Supply Chain Manager","description":"Safari Pharmacy is looking for a Supply Chain Manager to oversee procurement, logistics, and inventory management, ensuring timely delivery and cost-efficiency. This role is critical to supporting healthcare delivery.\n","company":"Safari Pharmacy","location":"Warri","job_type":"full-time","salary_range":"","deadline":"2025-08-31","requirements":"0–5 years of experience in supply chain or logistics, strong problem-solving and negotiation skills, proficiency in supply chain tools, and excellent organizational abilities.","link":"Interested and qualified candidates should forward their CV to: jobs@safaripharmacy.com using job title as subject of the email.","featured":false,"created_at":"2025-07-24 15:15:55.063831+00"}]