[{"idx":0,"id":"048be3c0-4a14-4c2a-9b78-2e710904ae46","title":"SkillUp Artisan SUPA Training Program","description":"The SkillUp Artisan SUPA Training Program is a federal government initiative aimed at enhancing the skills of Nigerian artisans. It's a collaboration between the Industrial Training Fund (ITF) and the government, focusing on providing free, tech-enabled training to empower artisans with modern vocational and digital skills. The program seeks to improve employability, address youth unemployment, and elevate the quality of skilled labor in Nigeria. ","deadline":"2025-12-31","eligibility":"Nigerian, 18 years and above.","category":"other","link":"https://supa.itf.gov.ng/","flyer_url":null,"featured":false,"created_at":"2025-07-08 08:14:11.175202+00","updated_at":"2025-07-08 08:14:11.175202+00"},{"idx":1,"id":"174cd547-432b-4588-a959-8a5c7deb6c86","title":"Pou Chen Group Foreign Student Internship 2025 in Taiwan (Fully Funded)","description":"Applications are now open for the Pou Chen Group Foreign Student Internship 2025. It is a Fully Funded International Internship in Taipei, Taiwan, at the Pou Chen Group’s headquarters. The Duration of the Internship is one year, and it will take place from July 2025 to June 2026. Applicants from around the world are eligible to apply, and they welcome candidates from all backgrounds.","deadline":"2025-12-31","eligibility":"The Internship is open to all Nationals.\nThird-year undergraduate or first-year graduate students.\nGPA above 3.0.\nProficiency in both English and Mandarin communication.","category":"internship","link":"https://oia.ntut.edu.tw/p/406-1032-145463,r2774.php?Lang=en","flyer_url":null,"featured":false,"created_at":"2025-06-23 07:20:26.125151+00","updated_at":"2025-06-23 07:20:26.125151+00"},{"idx":2,"id":"177cab38-531d-4941-8f81-6375489ba96d","title":"NIYA Gigs Program 2025 (FG)","description":"The FG NIYA Gigs Initiative is strategically designed to connect Nigerian youth to real, paying opportunities in the global gig economy.","deadline":"2025-12-31","eligibility":"Young persons interested in GIG Economy.","category":"","link":"https://yid.fmyd.gov.ng/niya-gigs/","flyer_url":null,"featured":false,"created_at":"2025-07-08 09:23:05.633496+00","updated_at":"2025-07-08 09:23:05.633496+00"},{"idx":3,"id":"189b1cb9-d298-441e-96db-27a1934739bb","title":"Global Youth Convention 2025","description":"The Global Youth Convention 2025 in Milan, Italy is a premier global forum designed to empower emerging youth leaders, social entrepreneurs, and change agents.\n\nOrganized by HISA – Public Policy Research Institute, GYC 2025 offers a transformative space where young voices collaborate, innovate, and drive ethical, inclusive, and sustainable impact.","deadline":"2025-09-19","eligibility":"All countries!","category":"fellowship","link":"https://headwayinstitute.org/global-youth-convention-2025/","flyer_url":null,"featured":false,"created_at":"2025-07-08 11:41:46.842446+00","updated_at":"2025-07-08 11:41:46.842446+00"},{"idx":4,"id":"1ac82798-1100-4d7b-afcb-3d09bf5b7a25","title":"Fulbright Scholarship 2025","description":"If you are a Nigerian student dreaming of pursuing a master’s or Ph.D. in the USA on a fully funded scholarship? The Fulbright Foreign Student Program 2025 offers you a golden opportunity to achieve your academic goals without worrying about tuition or living costs.","deadline":"2025-12-31","eligibility":"Nigerian students with excellent first degree.","category":"scholarship","link":"https://apply.iie.org/apply/?sr=a95d0c2b-824b-4661-adc9-96d4b0c3c772","flyer_url":null,"featured":false,"created_at":"2025-07-08 09:55:16.155374+00","updated_at":"2025-07-08 09:55:16.155374+00"},{"idx":5,"id":"1bfcaf1a-0ead-441b-baa6-b5960a9a96b3","title":"Google Student Researcher Program 2025","description":"Research opportunity for students globally.","deadline":"2025-11-07","eligibility":"Open to students enrolled in Bachelor's, Master's, or PhD programs.","category":"internship","link":"https://www.google.com/about/careers/applications/jobs/results/141568859843764934-student-researcher-bsms-wintersummer-2025","flyer_url":null,"featured":false,"created_at":"2025-05-27 09:25:25.733047+00","updated_at":"2025-05-27 09:25:25.733047+00"},{"idx":6,"id":"1c26d72a-9e3c-4e8e-9d8e-e30b7360fe57","title":"2025 University of Malta Scholarships For International Students","description":"The University of Malta Scholarship Programs offer tuition fee waivers to deserving students outside the European Union/EEA. The fee waiver will apply for the normal duration of the programme being followed.  ","deadline":"2025-10-15","eligibility":"To be eligible for the 2025 University of Malta Postgraduate Scholarships, applicants must have received unconditional admission to pursue either a Master's by research or a Ph.D. program, on a full-time or part-time basis. Additionally, candidates must submit a formal request for a fee waiver by emailing the University of Malta's International Office.\n","category":"scholarship","link":"https://www.um.edu.mt/study/feesfunding/scholarships/masterresearchphd/","flyer_url":null,"featured":false,"created_at":"2025-07-24 20:58:56.662224+00","updated_at":"2025-07-24 20:58:56.662224+00"},{"idx":7,"id":"1c622f5b-9793-427d-9798-99521098d8b6","title":"Yale Peace Fellowship 2026 | Fully Funded Fellowship","description":"Are you an emerging leader who advocates peace and harmony? The Yale Peace Fellowship 2026 can be an excellent opportunity for you. This fully funded fellowship program invites peace activists working on conflict resolution and peace building. The program is offered by International Leadership Centre at Yale University. 16 promising peace fellows will be selected who will attend both virtual and in-person sessions.","deadline":"2025-09-12","eligibility":"Applicants must have peacekeeping experience, strong leadership, cross-cultural understanding, English fluency, and be fully available for all program components, both virtual and in-person in the USA and UAE.\n","category":"fellowship","link":"https://jackson.yale.edu/international-leadership-center/apply-peace-fellowship/","flyer_url":null,"featured":false,"created_at":"2025-08-01 08:38:58.759763+00","updated_at":"2025-08-01 08:38:58.759763+00"},{"idx":8,"id":"1cfdc21b-d797-4ac9-9fe4-489fbe5ed3f6","title":"University of Bonn International Fellowship 2026 in Germany (Fully Funded)","description":"Are you a researcher in any field and looking for an opportunity to travel to Germany and work with renowned researchers? The Bonn International Fellowships invite excellent researchers from all disciplines to the University of Bonn for short stays (up to 12 days).","deadline":"2025-09-22","eligibility":"Researchers","category":"fellowship","link":"https://www.uni-bonn.de/en/research-and-teaching/support-for-researchers-and-teachers/research-funding/university-grants/bonn-international-fellowships","flyer_url":null,"featured":false,"created_at":"2025-06-22 19:37:19.820701+00","updated_at":"2025-06-22 19:37:19.820701+00"},{"idx":9,"id":"2186d910-b343-42a8-8a93-2cef2d669e38","title":"Gates Cambridge Scholarships 2025","description":"Full tuition, living expenses, travel, and academic development support.","deadline":"2025-12-07","eligibility":"International Students","category":"Scholarship","link":"https://www.gatescambridge.org/","flyer_url":null,"featured":false,"created_at":"2025-05-01 21:55:42.095491+00","updated_at":"2025-05-01 21:55:42.095491+00"},{"idx":10,"id":"2274b709-03ce-432c-893b-3d92af7bbfc5","title":"Women in Engineering Day with 100 UNICAF Scholarships  ","description":"UNICAF is celebrating Intentional women in Engineering with 100 UNICAF scholarships.","deadline":"2025-12-31","eligibility":"Women in Engineering","category":"scholarship","link":"apply.unicaf.org","flyer_url":null,"featured":false,"created_at":"2025-07-10 09:30:54.273823+00","updated_at":"2025-07-10 09:30:54.273823+00"},{"idx":11,"id":"250ef1ee-fd0e-4f71-b272-9008e6530582","title":"DeepTech AI Training Program by Data Science Nigeria, in partnership with 3MTT and Google","description":"DeepTech Ready by Data Science Nigeria (DSN) is now open for applications. This is a unique, high-impact training program designed to equip you with job-ready Data Science and Artificial Intelligence (AI) skills that are in high demand in today’s tech-driven economy.\n\nWhether you’re a student, graduate, or professional looking to transition into tech, this program is tailored to provide practical, hands-on learning combined with real-world project experience and mentorship.\n\nThis initiative is delivered in collaboration with the 3 Million Technical Talent (3MTT) Program by the National Information Technology Development Agency (NITDA) and supported by Google.org","deadline":"2025-12-31","eligibility":" it’s designed for individuals who are:\n\nPassionate about Data Science & AI: A genuine interest and strong motivation to build a career in these fields is crucial.\nCommitted to Learning: The self-paced nature requires discipline and dedication to complete the courses and projects.\nProblem-Solvers: An analytical mindset and a desire to use data to solve real-world problems.\nAspiring Professionals: Individuals looking to transition into a tech career, upskill, or solidify their foundational knowledge in Data Science and AI.\nTech-Savvy (Basic Level): While advanced tech skills might not be a pre-requisite, a basic comfort with computers and online learning environments would be beneficial.\nReady for Job Readiness: Those who are actively seeking employment opportunities in Data Science and AI upon program completion.","category":"mentorship","link":"https://3mtt.nitda.gov.ng/deeptech/","flyer_url":null,"featured":false,"created_at":"2025-07-08 10:30:07.507064+00","updated_at":"2025-07-08 10:30:07.507064+00"},{"idx":12,"id":"262f6d1e-da6d-4c6e-a35c-6e37e3edcaf0","title":"Max Planck Doucet Scholarship 2026 in Germany (Fully Funded)","description":"The Applications are open to apply for the Max Planck Doucet Scholarship 2026 in Germany. It is a Fully Funded 3-month research Fellowship at the Max Planck Institute for Legal History and Legal Theory. The Program aims to invite Young Researchers from outside Frankfurt, Germany, and especially from Latin America. There is no application fee, and all the expenses are covered.","deadline":"2025-09-15","eligibility":"Candidates from all countries are eligible.\nYou should be a young researcher residing outside of Frankfurt, with a strong preference for candidates from Latin America.\nYour proposal must center on the history of colonial law and clearly state your intention to utilize the Doucet Collection.\nApplication materials must be submitted in either English or Spanish.","category":"scholarship","link":"https://jobs.lhlt.mpg.de/jobposting/850b8f63a3c7f0e936eda60814f1ccbb686edb3e0","flyer_url":null,"featured":false,"created_at":"2025-06-22 19:47:41.111861+00","updated_at":"2025-06-22 19:47:41.111861+00"},{"idx":13,"id":"36950226-60b9-4f88-bf67-9bc7dcaada5d","title":"INTERPOL Internship 2025 in France (Fully Funded)","description":"Applications are now open for the INTERPOL Internship 2025 in France. It is a Fully Funded Internship in France for International students from around the world. The Duration of the Internship is from 6 to 11 Months, and it will take Place at the Interpol HQ, Lyon, France.","deadline":"2025-12-31","eligibility":"You must be a national of an Interpol member country.\nYou should either be currently enrolled in or have graduated within the past year from an accredited post-secondary academic institution.\nYou must have reached the legal age of majority in your home country.\nFinally, you need to be fluent in English.","category":"other","link":"https://www.interpol.int/en/What-you-can-do/Careers/Internships","flyer_url":null,"featured":false,"created_at":"2025-06-23 06:21:04.145732+00","updated_at":"2025-06-23 06:21:04.145732+00"},{"idx":14,"id":"3a5f25e9-f106-4fbc-9207-fd076ef6081c","title":"SMEDAN-Wema Capacity Development Program 2025","description":"Wema Bank and the Small and Medium Enterprise Development Agency of Nigeria (SMEDAN) have launched application for the 2025 SMEDAN-Wema Capacity Development Program.\n\nThe SMEDAN-Wema Capacity Development Program aims to equip entrepreneurs with the skills, knowledge, and resources needed to thrive in today’s competitive business environment.","deadline":"2025-12-31","eligibility":"To qualify, you must have an existing business and be a registered member of SMEDAN","category":"other","link":"https://wema-smedan-pilot.azurewebsites.net/","flyer_url":null,"featured":false,"created_at":"2025-07-08 06:40:46.683082+00","updated_at":"2025-07-08 06:40:46.683082+00"},{"idx":15,"id":"3e38edae-cec0-46f5-b275-093d868cc194","title":"Chulabhorn Graduate Institute Scholarship 2026 in Thailand | Fully Funded","description":"Chulabhorn Graduate Institute Scholarship in Thailand 2026 welcomes those individuals who wish to go abroad for studies but whose financial circumstances do not allow them to pursue their dreams. This CGI Scholarship 2025 attracts all students belonging to different nationalities, origins, races, and religions to reach their career destinations through excellent international academic studies. You can apply for this fully funded scholarship if you have a CGPA of 2.75 in your Bachelor’s degree in applied biological, environmental, and chemical sciences and have excellent proficiency in the English language. ","deadline":"2025-09-30","eligibility":"Applicants must be under 30 years old, hold a bachelor’s degree (minimum CGPA 2.75) in relevant science, medical, or pharmaceutical fields, have lab research experience, demonstrate English proficiency (IELTS/TOEFL), and submit a purpose statement outlining their study interest.\n","category":"scholarship","link":"https://www.cgi.ac.th/admissions/cgi-scholarship-international/","flyer_url":null,"featured":false,"created_at":"2025-07-31 21:36:40.367664+00","updated_at":"2025-07-31 21:36:40.367664+00"},{"idx":16,"id":"40eb1f4c-2fb6-407e-b6f4-2f8c6979e98f","title":"MTN Skills Academy Program","description":"Free digital training with certification for Africans.","deadline":"2025-12-31","eligibility":"Open to African citizens.\n","category":"mentorship","link":"https://skillsacademy.mtn.com","flyer_url":null,"featured":false,"created_at":"2025-05-27 09:30:56.175262+00","updated_at":"2025-05-27 09:30:56.175262+00"},{"idx":17,"id":"462ceb3a-2d3f-42f4-b05c-ecd4885f76c7","title":"Applications Open for Developers Foundry 2.0: Elevate Your Tech Career in One Year – Tuition-Free!","description":"Are you a budding developer in Nigeria or Ghana with 2–3 years of experience and ready to take your tech career to the next level?\n\nThe Developers Foundry 2.0 Fellowship is your chance to go from entry-level to mid-level tech talent in just one year—completely free of charge!","deadline":"2025-12-31","eligibility":"Be currently residing in Nigeria or Ghana,\nHave 2–3 years of experience in a tech-related role,\nBe ready to commit to a one-year intensive learning journey,\nBe passionate about upskilling and career growth in the tech space.","category":"fellowship","link":"https://forms.office.com/pages/responsepage.aspx?id=2wYhaHuaNUu5oIhHM4XWz3Sr1P9D-yxAjSP50T8Re4BUMDVLQ1BVVENLNVhOUjJOVTJMN0NEWkJVQi4u&route=shorturl","flyer_url":null,"featured":false,"created_at":"2025-07-08 10:49:05.170271+00","updated_at":"2025-07-08 10:49:05.170271+00"},{"idx":18,"id":"4b9df43a-209d-4ae2-9ece-7ce300d70397","title":"Google Internship Program","description":"Are you a student or recent graduate looking for a golden opportunity to kickstart your career with one of the world’s leading tech companies?  The Google Internship Program 2025 is now open, offering motivated individuals the chance to learn, innovate, and work on real projects that impact billions of people worldwide.","deadline":"2025-12-31","eligibility":"To be considered for the Google Internship Program 2025, applicants must meet the following criteria:\n\nMust be currently enrolled in a Bachelor’s, Master’s, or PhD program in a relevant field (e.g., Computer Science, Engineering, Business, Marketing, etc.).\nDemonstrated academic excellence and problem-solving skills.\nProficiency in relevant tools or languages (e.g., Python, Java, SQL for tech roles; marketing analytics tools for business roles).\nStrong communication and teamwork abilities.\nEager to learn, adjust, and thrive in a dynamic setting.\nFor international applicants, eligibility may vary depending on visa requirements of the host country.","category":"internship","link":"https://www.google.com/about/careers/applications/buildyourfuture/internships","flyer_url":null,"featured":false,"created_at":"2025-08-26 20:53:10.41811+00","updated_at":"2025-08-26 20:53:10.41811+00"},{"idx":19,"id":"4c40c1e3-45ac-470e-8cf4-674064b9dfb5","title":"MTN Digital and Financial Skills Learning Program 2025 for Africans","description":"MTN, with the strategic intent of ‘Leading digital solutions for Africa’s progress,’ aims to bridge the digital divide, enhance financial inclusion, and contribute to the UN SDGs.\n\nCommitted to community support, MTN leverages its core business activities to empower stakeholders.\n\nStrategic Digital Skills Programs:\nThe Skills Academy understands the dynamic digital economy and tailors its programs to meet current employer demands and employment opportunities across Africa.","deadline":"2025-12-31","eligibility":"African countries.","category":"other","link":"https://skillsacademy.mtn.com/","flyer_url":null,"featured":false,"created_at":"2025-07-08 10:07:42.566174+00","updated_at":"2025-07-08 10:07:42.566174+00"},{"idx":20,"id":"4d454344-abb5-49da-91e0-07efd0a450bd","title":"KAUST Global Fellowship Program 2026 in Saudi Arabia | Fully Funded","description":"The KAUST Global Fellowship 2026 in Saudi Arabia is a tremendous opportunity for those who are zealous about steering innovative research in the Middle East. The fully-funded fellowship program supports brilliant emerging research leaders from around the world. It offers a chance to provide students with practical life experiences in crises when the world has already been entangled under the shades of the fatal pandemic. ","deadline":"2026-01-15","eligibility":"This 3-year postdoctoral scholarship is for PhD holders (within 4 years) or researchers with 4 years' experience, focused on global challenges aligned with five key pillars, and requires eligibility for residency in Saudi Arabia.","category":"fellowship","link":"https://www.plutoedu.com/form/983580488","flyer_url":null,"featured":false,"created_at":"2025-08-01 06:46:52.088247+00","updated_at":"2025-08-01 06:46:52.088247+00"},{"idx":21,"id":"4d5afa82-f929-4887-8d8a-193e35cd6821","title":"2025 Getty Scholars Research Program","description":"The Getty Scholars Program supports innovative research about art, conceived in the broadest terms, and its histories, by providing a locus for international scholars to forge collaborations across disciplines and professional practices, while also developing new audiences for their work.\n\nDuring their residency, the scholar cohort is immersed in a vibrant local community devoted to the advancement of knowledge and hosted at an institution committed to preserving, understanding, interpreting, and sharing its vast library and collections.","deadline":"2025-10-01","eligibility":"Scholar Grant applicants should have received a PhD before September 1, 2022.\nApplicants from associated fields who do not hold a PhD but have commensurate professional experience will also be considered.\nApplicants who received their doctoral degree after September 1, 2022 should apply for a Postdoctoral Fellowship.","category":"fellowship","link":"https://www.getty.edu/projects/getty-scholars-program/","flyer_url":null,"featured":false,"created_at":"2025-07-09 08:59:22.699778+00","updated_at":"2025-07-09 08:59:22.699778+00"},{"idx":22,"id":"534e284d-103b-4dfe-bb3d-9e4502f1d88c","title":"Nestle IMD Business School Scholarship 2025 | Study in Switzerland","description":"The Nestle MBA Scholarship in Switzerland is a study opportunity for a Master’s in Business Administration (MBA) degree in Lausanne.\n\nThe Nestle MBA Scholarship at IMD Business School offers a CHF 40,000 grant to support the tuition costs of study at the Institut pour l’Edude des Méthodes de Direction de l’Entreprise (IMEDE) in Switzerland.","deadline":"2025-12-31","eligibility":"All countries.","category":"scholarship","link":"https://www.imd.org/degree/mba/scholarships/nestle-scholarship-for-women","flyer_url":null,"featured":false,"created_at":"2025-07-08 10:21:54.844988+00","updated_at":"2025-07-08 10:21:54.844988+00"},{"idx":23,"id":"5467da92-b580-4fb0-b3f1-a4e53a650299","title":"NHR Scholarships in Germany 2026 | Funded Program","description":"Applications for NHR Scholarships in Germany are currently open for 2026-2029 session. This funded scholarship program is an excellent opportunity for students to pursue their research studies in Germany. The scholarship in Europe for international students will provide 2200 Euros per month for up to 3 years. Students will get a chance to work on advanced and innovative research projects in the field of High-Performance Computing (HPC). They will be supervised by leading researchers. Scholars will participate in workshops and training programs conducted by professionals. These sessions will teach latest knowledge and skills in HPC.","deadline":"2025-09-15","eligibility":"PhD scholarships at NHR are open to all qualified Master's graduates from relevant fields who meet the NHR Center's and subject-specific doctoral admission requirements.","category":"scholarship","link":"https://www.nhr-verein.de/application","flyer_url":null,"featured":false,"created_at":"2025-08-01 06:12:08.625762+00","updated_at":"2025-08-01 06:12:08.625762+00"},{"idx":24,"id":"624a70ef-33ce-4377-ac08-92cc2fdbb271","title":"FG TVET Initiative Program for Trainers ","description":"Following the launch of the FG TVET Initiative Program, the Federal Government has launched a separate application for the FG TVET Initiative Program Trainers.\n\nThe FG TVET Initiative Program for Trainers is for Skill Training Centres (STCs), Vocational Enterprise Institutions (VEIs), and Mastercraft Persons (MCPs) who will train individuals, grow entrepreneurship, and reduce unemployment among youths.\n\nSelected trainers will get a monthly stipend of ₦30,000 to train TVET students and will also be eligible for government funding and loans.","deadline":"2025-12-31","eligibility":"The FG TVET Initiative Program for Trainers is open to Mastercraft Persons (MCPs), Vocational Enterprise Institutions (VEIs), and Skill Training Centres (STCs) that meet specific requirements. MCPs must have a CAC registration or NIN, adopt NSQ-based curricula, have at least one qualified senior artisan per program, provide essential facilities like workshops and restrooms, and demonstrate prior training experience. VEIs must be CAC registered, adopt NSQ-based curricula, have at least one qualified instructor per trade (with a 1:40 instructor-to-student ratio), one Quality Assurance Assessor (QAA), and one certified Internal Quality Assurance Manager (IQAM), along with essential infrastructure and documented training experience. STCs must also have CAC registration, adopt NSQ curricula, provide at least one qualified instructor or artisan per program (minimum NSQ Level 3 certification), at least one QAA and one IQAM per trade, adequate technical and support staff, essential facilities, and a proven history of delivering training and certifications.","category":"other","link":"https://www.digitalnbte.nbte.gov.ng/TVET/TVETApplication2","flyer_url":null,"featured":false,"created_at":"2025-07-24 14:32:44.145727+00","updated_at":"2025-07-24 14:32:44.145727+00"},{"idx":25,"id":"656b0a6e-fe65-424f-868d-e0353090467b","title":"ASEF Training and Youth Summit in Denmark | Fully Funded","description":"ASEF is offering an exceptional Training and Youth Summit in Denmark for young delegates. The fully funded youth program will include both online and in-person training sessions, making it a blended learning program. The exciting part is that there is no registration or participation fee for both online and physical programs. The organizers will provide accommodation, and meals during the Youth Summit in Copenhagen. The travel costs including airfare, visa fees, and transportation will be reimbursed. This is an incredible learning opportunity that you shouldn’t be missing to avail.","deadline":"2025-09-09","eligibility":"Applicants must be early-career professionals (up to 35 years old) with strong English and local language skills, currently working in science management or international S\\&T diplomacy in one of the eligible Asian or European countries listed.\n","category":"other","link":"https://asiaeuropefoundation.formstack.com/forms/asefscitech2025_applicationform","flyer_url":null,"featured":false,"created_at":"2025-08-01 06:49:47.411806+00","updated_at":"2025-08-01 06:49:47.411806+00"},{"idx":26,"id":"65c27de3-b004-4449-9bcc-34ea90451239","title":"2025 Vital Impact Environmental Photography Grant","description":"Vital Impacts is a women-led 501c3 non-profit organization that uses art and storytelling to amplify and support the work of communities who are protecting people, wildlife and habitats worldwide.\n\nGrants serve a dual purpose: to provide support and encouragement to visual storytellers embarking on long-term documentary photography projects, and to foster collaboration with local communities dedicated to environmental and wildlife conservation efforts.\n\nVital Impacts is proud to offer one $20,000 (US) grant to an established environmental photographer, along with six $5,000 (US) grants to emerging photographers from across the globe.\n\nThese funds are specifically earmarked for the development of documentary projects focusing on environmental stories, with each grant supporting a separate photographer and project over the course of twelve months.","deadline":"2025-09-15","eligibility":"The 2025 Vital Impact Environmental Photography Grant is open to local photographers who are deeply connected to their communities and passionate about documenting environmental issues, especially those affecting their immediate surroundings. Vital Impacts seeks individuals who can effectively capture and communicate the complexities of environmental or conservation challenges, as well as highlight potential solutions through powerful visual storytelling.\n","category":"grant","link":"https://site.picter.com/vital-impacts-environmental-photography-grant-2025","flyer_url":null,"featured":false,"created_at":"2025-07-24 21:16:32.734904+00","updated_at":"2025-07-24 21:16:32.734904+00"},{"idx":27,"id":"69ed60d7-d7b5-451b-b760-7a8eea24d281","title":"2026 WTO Internship Program","description":"Applications are open for the World Trade Organization -WTO Internship for students from developing countries.\n\nWTO Internship Programme provides an opportunity for students from WTO member and observer countries to gain valuable experience from working at the WTO. The program offers comprehensive training and mentorship for selected applicants as well as a monthly stipend of CHF 1800 per month.","deadline":"2025-12-31","eligibility":"To be eligible for the 2026 World Trade Organization Internship, applicants must be nationals of a WTO member state or a country/customs territory in accession talks, have completed undergraduate studies in a relevant field and at least one year of postgraduate studies, and be between 21 and 30 years old during the internship.","category":"internship","link":"https://wto.wd3.myworkdayjobs.com/en-US/External/details/Intern_JR103492","flyer_url":null,"featured":false,"created_at":"2025-07-24 14:39:36.502141+00","updated_at":"2025-07-24 14:39:36.502141+00"},{"idx":28,"id":"70721684-0662-47da-86a0-cd696cc54e8d","title":"Abiola Ajimobi Foundation Scholarship (SAAF) 2025","description":"Application for the 2025 Abiola Ajimobi Foundation Scholarship has commenced for all interested and qualified Nigerian students.\nThe Ajimobi Foundation Scholarship seeks to offer educational support grants to students at undergraduate and postgraduate levels of education in Nigerian tertiary institutions.","deadline":"2025-12-31","eligibility":"SAAF offers scholarships and educational support to deserving students, enabling them to access quality education and pursue their dreams.","category":"scholarship","link":"https://www.abiolaajimobifoundation.com/","flyer_url":null,"featured":false,"created_at":"2025-07-08 08:18:10.447039+00","updated_at":"2025-07-08 08:18:10.447039+00"},{"idx":29,"id":"74826438-0f57-42fb-8a73-d9a239dab1ec","title":"University of Warwick Research Scholarships 2026 in UK","description":"The University of Warwick Postgraduate Research Scholarships in the UK is a fully funded PhD Studentship in Negative Emissions Technologies for: NET2ZERO.\n\nThe Warwick Chemistry network has over 180 research students running cutting-edge projects across chemical research.\n\nWhether you are looking for a one-year MSc by Research, or a four-year PhD course, our programmes will equip you for a wide range of careers in industry and academia.\n\nThe EPSRC and BBSRC Centre for Doctoral Training (CDT) in Negative Emission Technologies for Net Zero (Net2Zero) is a partnership between Aston University (lead), University of Nottingham, Queen’s University Belfast, and University of Warwick.\n\nThe Net2Zero CDT will develop your skills in anticipation of significant sector expansion. The Net2Zero research projects cover engineered negative emission technologies.","deadline":"2025-10-06","eligibility":"A Masters degree in a relevant subject with a 60% or higher weighted average (or expected to achieve),\nA First or Upper Second-Class Honours degree (or an equivalent qualification) in a relevant subject.","category":"scholarship","link":"https://warwick.ac.uk/fac/sci/chemistry/admissions/postgraduateresearch/","flyer_url":null,"featured":false,"created_at":"2025-07-30 23:01:38.203546+00","updated_at":"2025-07-30 23:01:38.203546+00"},{"idx":30,"id":"77248098-f020-4121-8916-c70cc237aa76","title":"2026 Tokyo City University Scholarship","description":"Tokyo City University are pleased to announce a scholarship open to privately financed international students entering a master’s course at Tokyo City University (TCU) and who wishes to continue to a doctoral course.\n\nThe Tokyo City University Scholarship is intended to partially cover the expenses of establishing a suitable study environment.\n\nThe goal of this TCU scholarship 2026 is to educate leaders who, building on their research and achievements at TCU, will take an innovative role in an international society as well as a bridge among TCU and their countries and universities.","deadline":"2025-10-02","eligibility":"All countries!","category":"scholarship","link":"https://partnership.itb.ac.id/tokyu_tcu2026/","flyer_url":null,"featured":false,"created_at":"2025-07-08 10:32:48.175963+00","updated_at":"2025-07-08 10:32:48.175963+00"},{"idx":31,"id":"79b71223-06f8-4d5c-8a73-ee9ea9c739ff","title":"OIST Research Internship 2026","description":"The applications for the OIST Research Internship 2026 are now open. This is a fully funded internship program in Japan, with a duration of 3 to 6 months. The internship is offered by the OIST Graduate School to help students gain experience in one of the world’s best laboratories under top mentors. The OIST internship for international students will take place between April 1, 2026, and September 30, 2026. Students from all around the world can apply for this opportunity.","deadline":"2025-10-15","eligibility":"Eligible applicants for the OIST Research Internship in Japan must be STEM students or graduates (Bachelor’s or Master’s), not PhD holders, from any country, with permission from their university if enrolled; applications must be in English, include a recommender, and be submitted online by October 15, 2025.","category":"internship","link":"https://www.oist.jp/admissions/research-internship/apply-research-internship","flyer_url":null,"featured":false,"created_at":"2025-08-01 06:36:00.228999+00","updated_at":"2025-08-01 06:36:00.228999+00"},{"idx":32,"id":"7a6e8ba3-7fcc-4830-9636-46280f891a30","title":"Chevening Scholarships 2025","description":"Fully funded for tuition fees, living costs, travel, and networking events.","deadline":"2025-11-02","eligibility":"Young Leaders, Professionals","category":"Scholarship","link":"https://www.chevening.org/","flyer_url":null,"featured":false,"created_at":"2025-05-01 21:55:42.095491+00","updated_at":"2025-05-01 21:55:42.095491+00"},{"idx":33,"id":"8046648b-6dca-4f24-9c11-493a4aca1f56","title":"Invest In Her Pitch Competition 2025","description":"Women in business, listen.\n\nInvest in Her Pitch Competition 2025 is here!\n\nInvest in Her is backing bold, scalable, high-growth startups with ₦6,000,000 in non-dilutive funding (that’s a grant, not equity).\n\n🥇 ₦3,000,000 Grand Prize\n🥈 ₦2,000,000 Second Place\n🥉 ₦1,000,000 Third Place\n\n Beyond cash prizes, winners also get:\nMentorship & training\nInvestor & sponsor exposure\nNetworking reception + goody bags","deadline":"2025-09-22","eligibility":"Women in business.","category":"grant","link":"https://docs.google.com/forms/d/e/1FAIpQLSdRC26FLUcj0KpaMJANycfegJm1iorEIwrunR25WEF40AptgA/viewform","flyer_url":null,"featured":false,"created_at":"2025-09-02 11:11:21.153246+00","updated_at":"2025-09-02 11:11:21.153246+00"},{"idx":34,"id":"895feb18-b99d-48a3-941d-825501f8fb5b","title":"Yenching Academy Fellowship 2026","description":"Fully funded Master’s degree in China Studies at Peking University.","deadline":"2025-12-01","eligibility":"Open to young people with at least a Bachelor’s degree (any discipline). Must be under 28.","category":"Scholarship, Fellowship","link":"yenchingacademy.pku.edu.cn","flyer_url":null,"featured":false,"created_at":"2025-05-01 21:55:42.095491+00","updated_at":"2025-05-01 21:55:42.095491+00"},{"idx":35,"id":"8a1bc020-150a-4667-b0a2-83be30de6efb","title":"OIST Research Internship in Japan 2026 | Fully Funded Internship Program","description":"The applications for the OIST Research Internship 2026 are now open. This is a fully funded internship program in Japan, with a duration of 3 to 6 months. The internship is offered by the OIST Graduate School to help students gain experience in one of the world’s best laboratories under top mentors. The OIST internship for international students will take place between April 1, 2026, and September 30, 2026. Students from all around the world can apply for this opportunity.","deadline":"2025-10-15","eligibility":"Applicants from any country with a STEM background must be in the final years or graduates of a bachelor's or master’s program, not hold a PhD, submit all documents in English, and have university permission if currently enrolled.\n","category":"internship","link":"https://www.oist.jp/admissions/research-internship/apply-research-internship","flyer_url":null,"featured":false,"created_at":"2025-08-01 08:45:24.810484+00","updated_at":"2025-08-01 08:45:24.810484+00"},{"idx":36,"id":"90daa8e5-79b8-4bea-9472-d0108abe316d","title":"Chevening Scholarship 2025–2026","description":"Fully funded 1-year Master’s degree in the UK (tuition, travel, monthly stipend).","deadline":"2025-11-01","eligibility":"Nigerian citizens eligible. Must have Bachelor’s degree and 2 years of work experience.","category":"Scholarship","link":"chevening.org","flyer_url":null,"featured":false,"created_at":"2025-05-01 21:55:42.095491+00","updated_at":"2025-05-01 21:55:42.095491+00"},{"idx":37,"id":"9692eba2-2559-4cfb-b414-06f30e88f9e1","title":"Call for Applications: Join the 2025 IEA Africa Energy Efficiency Policy Training Week","description":"The International Energy Agency (IEA) and the Ministry of Energy and Green Transition of Ghana are pleased to co-host the next Africa Energy Efficiency Policy in Emerging Economies Training Week, taking place in Accra, Ghana, from 20-23 October 2025. Since 2015 the IEA’s Energy Efficiency Policy Training Weeks have equipped more than 3 000 policymakers from over 128 countries with the tools and knowledge to implement effective energy efficiency policies.","deadline":"2025-10-17","eligibility":"The training is aimed at energy efficiency policymakers, principally from energy ministries and supporting\ninstitutions, but applications would be accepted from those in relevant sectors of industry or academia and NGOs involved in energy efficiency policy making.","category":"other","link":"https://www.iea.org/events/africa-energy-efficiency-policy-training-week-2025#practical-information","flyer_url":null,"featured":false,"created_at":"2025-07-21 21:23:49.439401+00","updated_at":"2025-07-21 21:23:49.439401+00"},{"idx":38,"id":"994103e8-8aca-4d1e-8427-f7c109131485","title":"2025 University of Malta Scholarships For International Students","description":"The University of Malta Scholarship Programs offer tuition fee waivers to deserving students outside the European Union/EEA. The fee waiver will apply for the normal duration of the programme being followed.  ","deadline":"2025-10-15","eligibility":"To be eligible for the 2025 University of Malta Postgraduate Scholarships, applicants must have received unconditional admission to a full-time or part-time Master by research or Ph.D. program and must formally request a fee waiver by contacting the International Office via email.","category":"scholarship","link":"https://www.um.edu.mt/study/feesfunding/scholarships/masterresearchphd/","flyer_url":null,"featured":false,"created_at":"2025-07-24 14:37:47.762897+00","updated_at":"2025-07-24 14:37:47.762897+00"},{"idx":39,"id":"a3c57326-2c56-48d6-9b2e-352f942ba7fb","title":"FME Diaspora Bridge Initiative","description":"Federal Ministry of Education Launches BRIDGE Program for Global Academic Collaboration\n\nThe Federal Ministry of Education (FME), in collaboration with the Tertiary Education Trust Fund (TETFund), has officially launched BRIDGE—Bridging Research, Innovation, Development & Global Engagement. The portal is now open for applications from interested and qualified individuals.\n\nThis strategic initiative is designed to connect Nigerian academics and professionals with their counterparts in the diaspora, fostering cross-border knowledge exchange, research advancement, and innovation.","deadline":"2026-04-02","eligibility":" BRIDGE program aims to empower the Nigerian academic landscape through increased access to global knowledge, international funding, meaningful partnerships, and modern educational practices.\n\nThrough BRIDGE, structured opportunities will be created for diaspora scholars to actively collaborate with Nigerian institutions, driving improvements in research, pedagogy, and industry alignment.","category":"other","link":"https://diaspora-bridge.ng/","flyer_url":null,"featured":false,"created_at":"2025-07-30 22:27:36.410908+00","updated_at":"2025-07-30 22:27:36.410908+00"},{"idx":40,"id":"b078ee30-a2d3-43c8-9024-2e738df4fae5","title":"Oando Foundation Green Youth Upskilling Program 2025","description":"The Oando Foundation Green Youth Upskilling Program is a transformative initiative aimed at equipping passionate and driven young individuals with the skills, knowledge, and resources needed to thrive in the green and technical sectors.\n\nThe Green Youth Upskilling Program offers access to grants and funding, hands-on training in renewable energy, recycling innovation, sustainable agriculture, and climate technology.","deadline":"2025-12-31","eligibility":"To be eligible for the Oando Foundation Green Youth Upskilling Program, applicants must be Nigerian citizens aged 20–35, have at least an SSCE, show strong interest in green or technical fields, be fully available for all sessions, and submit a complete application on time. Prior experience through volunteering or self-learning is a plus.","category":"other","link":"https://gyup.net/apply-for-grant/","flyer_url":null,"featured":false,"created_at":"2025-07-24 14:28:32.830789+00","updated_at":"2025-07-24 14:28:32.830789+00"},{"idx":41,"id":"b6fe2ab2-5753-4780-a046-c392e822c0f7","title":"Standard Chartered Women in Cyber Security Program 2025","description":"Women in Cyber Security is a collaboration between Standard Chartered Bank and Strathmore University to encourage more women to pursue careers in cybersecurity.","deadline":"2025-12-31","eligibility":"The program is tailored for early-career women in cybersecurity or those looking to break into the field. Its aim is to equip them with the skills and confidence necessary to grow and thrive in their careers.","category":"mentorship","link":"https://womenincybersec.strathmore.edu/#/","flyer_url":null,"featured":false,"created_at":"2025-05-27 14:09:17.063718+00","updated_at":"2025-05-27 14:09:17.063718+00"},{"idx":42,"id":"b8c74831-0809-492e-8953-fc6d952a00fa","title":"McDonald Fellowship 2026 by MS International Federation","description":"The McDonald Fellowship enables early-career multiple sclerosis researchers from low- and middle-income countries to work in a research institution outside of their own country.\n\nMSIF is the global movement of MS organisations, by and for people affected by MS. The organisation networks, learns from each other, mobilises and enables global collaborations to achieve the vital goals that can only be reached by coming together as a movement.\n\nThe Federation is made up of national MS organisations (including their staff, volunteers, and MS communities), the MSIF staff, boar,d and committees.","deadline":"2025-12-01","eligibility":"Eligible Countries: Low- and middle-income countries","category":"scholarship","link":"https://www.msif.org/research/awards-grants-and-fellowships/mcdonald-fellowships/","flyer_url":null,"featured":false,"created_at":"2025-07-08 10:38:19.728028+00","updated_at":"2025-07-08 10:38:19.728028+00"},{"idx":43,"id":"bb216cf5-66f6-4fb9-b206-01e66a71a042","title":"Fulbright Foreign Student Program 2025","description":"Full tuition, airfare, living allowance, and health insurance.","deadline":"2025-09-15","eligibility":"International Students","category":"Scholarship","link":"https://educationusa.state.gov/us-higher-education-professionals/recruitment-resources/leveraging-scholarships","flyer_url":null,"featured":false,"created_at":"2025-05-01 21:55:42.095491+00","updated_at":"2025-05-01 21:55:42.095491+00"},{"idx":44,"id":"c7855ca4-b878-4fa1-860a-d48b74ab3d6b","title":"The Reece Foundation Grant","description":"The Reece Foundation provides grants for locally led initiatives improving access to clean water and sanitation in underserved communities, both in Australia and internationally. The focus is on impactful, sustainable projects—not general maintenance or donations.","deadline":"2025-12-31","eligibility":"Eligible applicants include community-led organizations working on water and sanitation projects in underserved areas. Projects must demonstrate local impact and sustainability. General maintenance or donation requests are not funded. Both Australian and international initiatives are welcome to apply.","category":"grant","link":"https://www.reecefoundation.charity/get-involved/apply","flyer_url":null,"featured":false,"created_at":"2025-06-04 07:40:38.529778+00","updated_at":"2025-06-04 07:40:38.529778+00"},{"idx":45,"id":"c8640631-8618-462e-a4d1-d4faea4e82b1","title":"NITDA Digital Literacy For All Program 2025","description":"The NITDA Digital Literacy For All Program (DL4All) is a free online learning platform aimed at equipping young Nigerians with essential digital skills. The goal is to build a digitally inclusive Nigeria where everyone can access opportunities, contribute to national growth, and secure a better future. This post provides key details and application steps for interested and qualified candidates.","deadline":"2025-12-31","eligibility":"The NITDA Digital Literacy For All Program (DL4All) is a free online learning platform aimed at equipping young Nigerians with essential digital skills. The goal is to build a digitally inclusive Nigeria where everyone can access opportunities, contribute to national growth, and secure a better future. This post provides key details and application steps for interested and qualified candidates.","category":"other","link":"https://dl4all.nitda.gov.ng/","flyer_url":null,"featured":false,"created_at":"2025-07-24 14:20:34.594262+00","updated_at":"2025-07-24 14:20:34.594262+00"},{"idx":46,"id":"ca11c9ef-7867-4033-ba93-5e38cd35a2e7","title":"University of Cambridge Cambridge International Scholarships","description":"Full tuition, living expenses, travel, and visa support for selected students.","deadline":"2025-10-01","eligibility":"International Students","category":"Scholarship","link":"https://www.cam.ac.uk/","flyer_url":null,"featured":false,"created_at":"2025-05-01 21:55:42.095491+00","updated_at":"2025-05-01 21:55:42.095491+00"},{"idx":47,"id":"d416285e-b8ba-470d-beec-3691c3a77d67","title":"2025 Japan Africa Dream Scholarship – JADS","description":"JADS is a capacity building project organized by the African Development Bank and the government of Japan.\n\nThey provide two-year scholarship awards to African students studying at master level at their designated institutions.","deadline":"2025-11-30","eligibility":"Should have a minimum of a Bachelor’s degree or its equivalent in energy, agriculture, health, environmental sustainability, engineering studies or related areas; and have excellent academic records and relevant professional experience, and a history of supporting their countries’ development efforts.\nApplicants should have at least 1 year of paid employment in their home country or in other African countries after receiving their Bachelors (or equivalent university) degree within the past 3 years.\nCandidates should be 35 years old or younger, and in good health.\nCandidates should gain admission to an approved master’s degree course at a Japanese or African partner university – application for admission to be done directly through the partner universities (Refer to list of universities and approved courses).\nCandidates should not be enrolled in another graduate degree programs – the program does not support applicants who are already enrolled in graduate degree programs.\nMust  be a citizen of one of the African Development Bank’s regional member countries.\nApplicants must not be an Executive Director, his/her alternate, and/or staff of all types of appointments of the African Development Bank Group or a close relative of the aforementioned by blood or adoption with the term “close relative” defined as: Mother, Father, Sister, Half-sister, Brother, Half-brother, Son, Daughter, Aunt, Uncle, Niece, or Nephew.","category":"fellowship","link":"https://www.k.u-tokyo.ac.jp/en/exam/master/foreign_research_students/afdb_jads/","flyer_url":null,"featured":false,"created_at":"2025-07-09 15:29:39.405646+00","updated_at":"2025-07-09 15:29:39.405646+00"},{"idx":48,"id":"d46727a4-5057-4399-8cdd-3478cfa0e62a","title":"Junior Achievement Nigeria AI Training Program 2025","description":"Junior Achievement Nigeria (JAN) is part of the global Junior Achievement Worldwide (JAWW) network—an international non-governmental organization dedicated to economic empowerment.\n\nFounded in 1919, JAWW is the world’s oldest organization of its kind, with a presence in 121 countries.\n\nThis program offers a rare chance to build in-demand skills that will distinguish you in today’s rapidly changing job landscape.\n\nIt is currently available in the following states: Lagos, Ogun, Ondo, Oyo, Anambra, Gombe, Jigawa, FCT, Kaduna, Kano, Enugu, Rivers, Akwa Ibom, Plateau, and Nasarawa.\n","deadline":"2025-12-31","eligibility":"Youth aged 16 to 24 years\nUndergraduates and Graduates\nCorp members, Post Nysc Graduate","category":"other","link":"https://ja-nigeria.org/","flyer_url":null,"featured":false,"created_at":"2025-05-27 14:36:25.85864+00","updated_at":"2025-05-27 14:36:25.85864+00"},{"idx":49,"id":"da601ab2-dd82-48f7-83c9-288dcadab16b","title":"IATSS Forum Leadership Program in Japan 2026 (Fully Funded)","description":"The Applications are now open to apply for the 2026 IATSS Forum Leadership Program in Japan. It is a Fully Funded Leadership development Program in Japan for International applicants. The IATSS Forum Leadership Development Program is an 8-week intensive training Program on building Leadership skills.","deadline":"2025-09-30","eligibility":"Nationality: Must be a citizen of Cambodia, India, Indonesia, Laos, Malaysia, Myanmar, Philippines, Singapore, Thailand, or Vietnam.\nAge: 35 years old or younger.\nProfessional Experience: At least 2 years of full-time professional job experience.","category":"other","link":"https://www.iatssforum.jp/en/applications/","flyer_url":null,"featured":false,"created_at":"2025-06-23 06:04:25.585099+00","updated_at":"2025-06-23 06:04:25.585099+00"},{"idx":50,"id":"df41e177-d277-4b66-bb06-d6412b0f242d","title":"Schwarzman Scholars Program 2026","description":"Fully funded 1-year Master’s degree at Tsinghua University, China (tuition, travel, stipend).","deadline":"2025-09-12","eligibility":"Bachelor’s degree holders under 29 years. Open to all nationalities. Strong leadership qualities required.","category":"Scholarship, Fellowship","link":"schwarzmanscholars.org","flyer_url":null,"featured":false,"created_at":"2025-05-01 21:55:42.095491+00","updated_at":"2025-05-01 21:55:42.095491+00"},{"idx":51,"id":"e49a1b8b-0ad2-49dc-8dd3-c5be06646ac8","title":"Buzzify Nigeria is calling for Media Creative Interns","description":"Buzzify Nigeria is opening its doors to passionate individuals who are ready to explore the world of media and content creation.  \n\nThis is not just another internship, it's a chance to learn on the job, gain real exposure, and build hands-on skills in a creative environment.","deadline":"2025-10-03","eligibility":"Media Enthusiast","category":"internship","link":"@buzzify.ng, buzzifyng@gmail.com","flyer_url":null,"featured":false,"created_at":"2025-09-02 11:56:14.796705+00","updated_at":"2025-09-02 11:56:14.796705+00"},{"idx":52,"id":"e629d81c-1940-48be-beac-45a8b75f5076","title":"The Development Bank of Nigeria (DBN) Entrepreneurship Training Programme 2025 for Young Nigerian Entrepreneurs.","description":"Applications are now open for the 2025 DBN Entrepreneurship Training Programme (DBNETP). The annual DBN Entrepreneurship Training Programme (DBNETP) is the flagship programme of the Development Bank of Nigeria and is currently in its 7th Cycle. Capacity building is a core mandate of the Development Bank of Nigeria, and so far, the Bank has trained over 4000 MSMEs across Nigeria digitally and physically, leveraging partnerships and the DBN Learning Management System (LMS).","deadline":"2025-12-31","eligibility":"All applicants shortlisted for the onsite training must meet the below minimum eligibility criteria:\n\nOwner of business must be 18 years and above,\nBusiness owner must be a citizen or legal resident of Nigeria,\nThe business must be based in Nigeria,\nThe business must be for profit from any sector,\nApplicant must be available to commit to the training schedule once accepted.","category":"other","link":"https://learning.devbankng.com/","flyer_url":null,"featured":false,"created_at":"2025-07-21 05:49:20.00525+00","updated_at":"2025-07-21 05:49:20.00525+00"},{"idx":53,"id":"e883f432-797e-48a7-91e6-6b4be7eb5505","title":"Federal Government SMEDAN AgriBusiness Empowerment and Development Program 2025","description":"The Federal Government of Nigeria, through the Small and Medium Enterprise Development Agency of Nigeria, invites applications for the SMEDAN AgriBusiness Empowerment and Development Program.\n\nThe SMEDAN AgriBusiness Empowerment Program offers access to financial assistance, technical training, and capacity-building programs tailored to agricultural needs.","deadline":"2025-12-31","eligibility":"To be eligible for the SMEDAN AgriBusiness Empowerment and Development Program (ADEP), applicants must be individuals or organizations involved in agricultural production, processing, or marketing. This includes farmers, agri-entrepreneurs, cooperatives, associations, and enterprises—both small- and large-scale—engaged in any part of the agricultural value chain.","category":"other","link":"https://smedan.gov.ng/our-programs/adep/","flyer_url":null,"featured":false,"created_at":"2025-07-24 14:30:41.61351+00","updated_at":"2025-07-24 14:30:41.61351+00"},{"idx":54,"id":"f248657c-7870-421a-9850-e64aefed7f93","title":"UNS Scholarship for Students 2026 in Indonesia | Fully Scholarship","description":"Looking to study in Indonesia? The UNS Scholarship 2026 offers you an incredible chance to study for free! The fully-funded scholarship is granted for the Bachelor’s degree, Master’s degree, and Doctoral degree. The Indoesian scholarship is granted for a maximum of 8 semesters for Bachelor’s degree programs, a maximum of 4 semesters for Master’s degree programs, and a maximum of 6 semesters for Doctoral degree programs. You must meet the minimum grade requirement of the scholarship to get it for the whole duration of the program or must adhere to the academic regulations of Indonesian law.","deadline":"2025-09-30","eligibility":"Non-Indonesian applicants with financial support and no criminal or refugee status can apply to UNS, must complete required documents, meet TOEFL or equivalent scores (450 for natural sciences, 500 for social sciences), and be willing to attend an interview and take Indonesian language courses.","category":"scholarship","link":"https://uns.ac.id/en/admission/uns-scholarship/","flyer_url":null,"featured":false,"created_at":"2025-08-01 07:51:18.462281+00","updated_at":"2025-08-01 07:51:18.462281+00"},{"idx":55,"id":"f6a64c6c-4263-4de7-8529-822c00997958","title":"Nestle IMD Business School Scholarship 2025 | Study in Switzerland","description":"The Nestle MBA Scholarship in Switzerland is a study opportunity for a Master’s in Business Administration (MBA) degree in Lausanne.\n\nThe Nestle MBA Scholarship at IMD Business School offers a CHF 40,000 grant to support the tuition costs of study at the Institut pour l’Edude des Méthodes de Direction de l’Entreprise (IMEDE) in Switzerland.","deadline":"2025-12-31","eligibility":"All Nationals!","category":"scholarship","link":"https://www.imd.org/degree/mba/scholarships/nestle-scholarship-for-women","flyer_url":null,"featured":false,"created_at":"2025-07-08 09:47:04.612613+00","updated_at":"2025-07-08 09:47:04.612613+00"}]